[
  {
    "path": "posts/2021-04-13-stf-controle-concentrado/",
    "title": "O STF, o controle concentrado e a pandemia",
    "description": "Pequena análise das ações de controle concentrado de constitucionalidade ao STF entre 2000 e 2020.",
    "author": [
      {
        "name": "Rodrigo Filippi Dornelles",
        "url": "https://www.linkedin.com/in/rodrigo-dornelles-576705a2/"
      }
    ],
    "date": "2021-04-13",
    "categories": [],
    "contents": "\n\n\n\nIntrodução\nNo presente texto pretendo apresentar brevemente o resultado de uma análise feita das ações de controle concentrado de constitucionalidade distribuídas ao Supremo Tribunal Federal até o fatídico ano de 2020. Como sabemos, a sua atuação (e omissão…) causa o grande impacto social, político e econômico em nossa sociedade.\nA análise ocorreu no contexto de elaboração de trabalho final do curso de “Web scraping” da Curso-R e nela pude aplicar alguns conceitos apresentados pelo Prof. José Jesus em seu curso de Jurimetria aplicada: a ideia foi desenvolver ferramentas para raspar dados do Supremo Tribunal Federal (STF) e fazer algumas análises exploratórias preliminares e incipientes em cima destes dados.\nAdaptada para esse importante blog, procurei dar enfoque nos resultados que permita algumas reflexões sobre os efeitos da pandemia no perfil de temas submetidos à Corte e como foi a atuação das partes legitimadas ao longo de 2020.\nDelimitação do tema\nComo mencionado, analisaremos exclusivamente as ações de controle concentrado de constitucionalidade. Isso é, as classes processuais relativas a:\nAção Direta de Inconstitucionalidade (ADI),\nAção Declaratória de Constitucionalidade (ADC),\nAção Declaratória de Inconstitucionalidade por Omissão (ADO) e\nArguição de Descumprimento de Preceito Fundamental (ADPF).\nEssas classes processuais representam a atividade mais tradicional e típica de um Tribunal Constitucional em sua concepção clássica. Faz sentido, então, prestigiar e analisar a atuação do STF sob esse aspecto. (Não se ignore que o Supremo Tribunal Federal brasileiro tem competências que vão muito além disso, mas isso é papo para outro projeto…).\nAinda, é possível verificar nessas ações como se dão conflitos relevantes não apenas entre sociedade civil e poder público mas também entre os Poderes Legislativo e Executivo entre si. Também, evidencia a uma das mais relevantes faces da atuação da Procuradoria-Geral da República.\nDurante a pandemia, também, essas ações têm sido especialmente importantes para definição de esferas de responsabilidade (vide ADPF 722), a discussão sobre o plano de vacinação (ADPF 754 e ADPF 756), a proteção a grupos indígenas e quilombolas, etc.\nA ideia foi mapear aspectos como quantidade de ações por tipo/ano, quais os principais litigantes dessas ações (considerando-se os poucos legitimados para tanto), quais os principais temas dessas ações, as palavras-chave mais utilizadas nas petições iniciais, etc.\nCom os dados ora obtidos espera-se poder realizar todas essas análises (e várias outras) e contribuir para que a comunidade também possa se debruçar e refletir sobre essas questões.\nDados utilizados: utilidade e pertinência de web scraping\nJustifica-se a utilidade tendo-se em vista a importância (crescente?) do STF no cotidiano, não só das pessoas em carreiras jurídicas mas também da academia e das cidadãs e cidadãos comuns.\nPor outro lado, não existe API disponibilizada pelo Tribunal que permita o acesso automatizado e, embora seja louvável a disponibilização de uma listagem de todo o acervo da Corte, a informações como partes, andamentos e as peças processuais não se encontram disponíveis. Daí ser necessário, no caso, realizar a raspagem nas páginas do Tribunal.\nTrata-se de serviço público (cujo acesso à justiça é, inclusive, previsto na Constituição Federal) que, a despeito de sua importância, ainda é um ilustre desconhecido…\n(E, sabemos, o juridiquês em nada ajuda: torço para que por meio da ciência de dados seja possível melhor compreender e melhor explicar o que faz o STF.)\nPara tanto, foi aplicada a técnica do web scraping tal qual (muito bem) ensinada pela Curso-R.\nProdutos da raspagem\nPara os fins desse trabalho, foram selecionadas todas as ações autuadas a partir de 2000 (primeiro ano disponibilizado na listagem do STF) até 31/12/2020. Foram salvos dados sobre as ações em si (direto do STF), os respectivos números de incidente, as partes, os andamentos, e a petição inicial.\nUma explicação mais detalhada das estratégias utilizadas bem como o acesso integral aos códigos e dados obtidos encontra-se disponível no repositório do projeto no GitHub.\nAlgumas Análises\nSem qualquer pretensão de esgotar o tema, apresentamos aqui algumas análises exploratórias apenas para ilustrar o potencial do tema e mostrar a beleza que é o mundo jurídico (especialmente quando a ele se olha pela lente dos dados).\nDistribuição das ações ao longo dos últimos anos\nO primeiro aspecto que podemos observar é a quantidade de ações de controle concentrado de constitucionalidade ao longo dos anos. Abaixo, sem fazer distinção de qual categoria, vamos ver como se deu essa distribuição:\n\n\n\nAqui não estamos preocupados com o “saldo” de ações, ou seja, o gráfico acima não é afetado pela produtividade do Tribunal mas indica como variou a “procura” pela sua tutela constitucional ao longo do período.\nE chama muito a atenção a tendência acentuada no aumento ao longo dos últimos anos, em especial a partir de 2019. Uma hipótese para esse aumento é o cenário de crise institucional presente no país desde a eleição do atual Presidente da República.\nComo já noticiado, é uma característica de seu governo o excesso de Decretos editados, muitas vezes indo além dos limites legais. Já noticiou o UOL que, antes de terminado o primeiro semestre de 2019, já havia mais de 30 medidas questionadas no STF. Alguns veículos, como o Estadão, apontam uma espécie de estratégia da oposição de ir mais frequentemente ao Supremo contra atos da Presidência, sobretudo face um estado de tensão entre os Poderes.\n\n\n\nComo podemos verificar, se olharmos apenas os atos questionados que são de competência federal, efetivamente há um crescimento na proporção de atos infra-legais (aí incluídos os Decretos, exclusivos do Presidente da República).\nOutra explicação, agravada pelo contexto acima descrito, é a pandemia de COVID-19 que enfrentamos nesse momento. Veja-se que o ano de 2020 é recordista em ações constitucionais propostas.\nEvolução nas classes processuais\nUm outro aspecto interessante é observar quais os instrumentos vêm sendo mais utilizados dentre os 4 normalmente disponíveis no âmbito do controle de constitucionalidade.\nVeremos abaixo a evolução de cada uma das classes ao longo dos últimos anos:\n\n\n\nPercebe-se, naturalmente, uma prevalência da ADI, que se mantem constante, bem como uma baixa utilização da ADC e da ADO, que foram melhor regulamentadas ao longo do início dos anos 2000. Chama a atenção, contudo, como evoluiu - sobretudo nos últimos anos - a utilização da ADPF.\nIsso é curioso justamente por ser uma característica dessa ação a subsidiariedade. Ou seja, ela deveria ser residual em seu cabimento. Algumas hipóteses que podem explicar esse crescimento são uma maior criatividade dos proponentes, que vêm se ancorando em teses como a do “estado de coisas inconstitucional” a exemplo do utilizado nas ADPFs 347, 635, 709 e 760.\nAtividade dos proponentes\nSabemos que as ações de controle concentrado possuem um rol estreito de legitimados à sua propositura e que é previsto no artigo 103 da Constituição Federal. Basicamente, são esses:\nPresidente da República e Governadores,\nPoder Legislativo (Câmara dos Deputados, Senado, Assembleias Legislativas e Distrital),\nProcuradoria-Geral da República,\nConselho Federal da OAB,\nPartidos políticos com representantes no Congresso Nacional,\nConfederações sindicais ou entidades de classe de âmbito nacional.\nComo se vê, basicamente são membros do Executivo (Presidente/Governadores), do Legislativo e o chefe do Ministério Público. Ao lado deles, os partidos políticos, a representação da Advocacia e alguns poucos representantes da sociedade civil organizada (como os sindicatos e as entidades de classe nacionais). Há, portanto, uma grande primazia de órgãos/autoridades públicas e grandes “conglomerados” da sociedade civil que detém essa legitimidade.\nPodemos observar, então, como ao longo dos últimos anos tem sido o comportamento desses proponentes:\n\n\n\nUm outro ponto de vista interessante é observar não apenas o quanto cada classe de legitimado levou de ações ao STF em cada ano, mas também ver qual a esfera de competência do ato questionado. Isto é, se as ações eram relativas a atos federais ou subnacionais.\n\n\n\nChama bastante atenção o fato de a Procuradoria-Geral da República aparentemente ter dedicado bastante ênfase nos atos de Estados e Municípios em detrimento dos atos federais.\nEm 2020: Atuação dos proponentes ao longo do ano\nPensando no momento peculiar em que vivemos, um aspecto interessante a observar é como se deu a atuação dos proponentes ao longo desse ano. Vejamos:\n\n\n\nPodemos ver que a atuação dos Estados e DF (via Governadores) se deu de forma mais intensa no início do ano, enquanto a OAB atuou de forma mais ativa nos primeiros meses da pandemia.\nAs organizações da sociedade civil e os partidos tiveram atuação intensa durante todo o ano, com picos nas fases iniciais da pandemia.\nA Presidência da República, quando agiu, foi apenas no meio do ano. A PGR, por sua vez, teve atuação mais destacada no inicio da pandemia e mais recentemente, a partir de novembro.\nAtuação da OSC e Partidos\nEmbora quase residual em termos de competência para atuação, as organizações da sociedade civil (OSC), compreendendo sindicatos, confederações, etc têm tido atuação expressiva e de grande importância nos últimos anos. Da mesma forma, os partidos políticos têm se mostrado bastante combativos no âmbito do STF.\nUma nota importante é que, ao contrário dessas associações, os Partidos políticos possuem a chamada “legitimidade universal” e, por isso, em tese podem apresentar ações em qualquer tema enquanto as OSCs apenas nos temas que dizem respeito direto aos seus associados.\nVeremos algumas dessas entidades que têm litigado perante o Supremo Tribunal Federal.\nQuais partidos políticos\nAbaixo lista de quais partidos mais apresentaram ações. Um grande destaque para os Partidos tradicionalmente tidos como de esquerda.\n\nnome\nn\nPARTIDO SOCIALISTA BRASILEIRO PSB\n88\nPARTIDO DEMOCRATICO TRABALHISTA PDT\n87\nPARTIDO SOCIALISMO E LIBERDADE PSOL\n86\nPARTIDO SOCIAL LIBERAL PSL\n80\nPARTIDO DA SOCIAL DEMOCRACIA BRASILEIRA PSDB\n73\nPARTIDO DOS TRABALHADORES\n67\nREDE SUSTENTABILIDADE\n66\nPARTIDO DEMOCRATICO TRABALHISTA\n52\nSOLIDARIEDADE\n48\nPARTIDO TRABALHISTA BRASILEIRO PTB\n40\n\nQuais associações, sindicatos, etc\nAqui as associações que mais apresentaram ações de controle concentrado no STF. Destaque para associações ligadas às carreiras jurídicas.\n\nnome\nn\nASSOCIACAO DOS MAGISTRADOS BRASILEIROS AMB\n102\nCONFEDERACAO NACIONAL DA INDUSTRIA\n72\nASSOCIACAO NACIONAL DOS MEMBROS DO MINISTERIO PUBLICO CONAMP\n63\nCONFEDERACAO NACIONAL DO COMERCIO DE BENS SERVICOS E TURISMO CNC\n48\nASSOCIACAO NACIONAL DAS OPERADORAS CELULARES ACEL\n45\nCONFEDERACAO BRASILEIRA DE TRABALHADORES POLICIAIS CIVIS COBRAPOL\n43\nCONFEDERACAO NACIONAL DO COMERCIO CNC\n43\nCONFEDERACAO DOS SERVIDORES PUBLICOS DO BRASIL CSPB\n41\nASSOCIACAO DOS NOTARIOS E REGISTRADORES DO BRASIL ANOREGBR\n39\nASSOCIACAO NACIONAL DOS MAGISTRADOS ESTADUAIS ANAMAGES\n37\n\nO Supremo e a Pandemia\nSabemos que uma das razões que mostram um pico de casos em 2020 são as implicações em todos os níveis que a pandemia de COVID-19 nos trouxe.\nDúvidas sobre os limites federativos, questionamento de atos legislativos ou executivos, omissão do Governo Federal, etc foram algumas das muitas questões levadas à Corte.\nVeremos a seguir a proporção de ações relativas à pandemia em relação aos demais temas ao longo dos meses de janeiro até o fim de novembro de 2020:\n\n\n\nVemos que, efetivamente, a partir de março esse foi um dos grandes temas que chegaram até a Corte, evidenciando sua importância inclusive no âmbito jurídico e político.\nNos meses de maio e julho, inclusive, essas ações relacionadas à pandemia foram mais frequentes do que os outros temas reunidos.\nOs legitimados e a COVID\nVamos observar, brevemente, quais foram os legitimados que mais trouxeram o tema para a Corte:\n\n\n\nSe relacionando de alguma maneira com a tendência de serem os protagonistas em número de ações, também quanto à COVID os partidos e as OSC foram recordistas de ações.\nVocabulário das ações\nPor fim, encerrando o projeto, foi feita uma incipiente e exploratória análise das palavras mais comuns nas ações relacionadas a COVID e as que se dão em outros temas.\nTrata-se, muito mais, de um mínimo produto viável para verificar os termos mais frequentes com cada tema e, naturalmente, não é possível concluir quase nada. Divide-se esse intento com a comunidade na esperança de feedbacks e sugestões de como aprimorar essa análise no futuro.\n\n\n\n\n\n\nVemos que nas ações relativas ao COVID-19 aparece, - além de “saúde” - termos como indígenas, quilombolas, povos, dados, proteção, efeitos, etc, que podem sugerir que a tutela requerida ao Supremo é no sentido de buscar proteção para as consequências do contexto, tendo em mente também grupos vulnerabilizados.\nDe outro lado, nos casos relativos a outros temas, vemos expressões como trabalho, Amazônia, decreto, ambiente, e recursos. Provavelmente temas da agenda ambiental, sobre aspectos trabalhistas e financeiros foram levados ao Tribunal ao longo desse ano.\nÉ também possível observar como variam as palavras mais usadas conforme a categoria do proponente. Foram separadas as palavras mais usadas por cada uma delas e plotadas as nuvens abaixo.\nPodemos formular algumas hipóteses sobre a atuação de cada um desses grupos?\n\n\n\nProvavelmente nada muito contundente por enquanto, mas pode ser interessante aplicar a esses dados técnicas mais aguçadas de mineração de texto.\nA título especulativo, destacaria que parece interessante o fato de partidos políticos terem destacados termos como saúde, segurança, infraestrutura e eleitoral. Lembrando do falado acima, a legitimidade universal sugere que esse grupo leva à Corte temas diversos.\nDe outro lado, as organizações da sociedade civil - nas quais, como vimos, se destacam as entidades de classe de servidores públicos - têm entre os destaques os termos competência, servidores, regime, cargo, concessão, e outros sugestivos de matéria precipuamente de direito administrativo. Estariam essas entidades levando ao STF primordialmente temas relativos a direitos e deveres de suas categorias?\nA Ordem dos Advogados do Brasil em destaque para termos como advogados, princípio, pagamento, recursos, custas, valores e competência, possivelmente relacionados a questões tributárias, de processo e exercício da atividade da advocacia.\nA PGR traz com frequência termos como código, normas, competência, administração, cargos e outras expressões também bastante relacionadas ao direito público (embora o termo civil também seja bastante destacado).\nAs palavras referentes à Presidência da República são bem pouco conclusivas, pois traz expressões como ADPF, princípio, relator, preceitos, expressão que são muito inerentes à retórica jurídica: ou seja, são expressões esperadas em qualquer tipo de ação constitucional, sendo difícil dizer a que argumentos de mérito podem estar relacionados. Contudo, há destaque grande para as expressões exercício e liberdade. O que poderá significar?\nPor fim, as expressões destacadas para Governadores indicam grande vínculo a matérias administrativas: assembleia e legislativa pode sugerir que a maior parte das ações digam respeito a normas Estaduais (aprovadas pela “Assembleia Legislativa”). Curiosamente, se nota dois nomes próprios: Jose e Silva, que provavelmente dizem respeito ao jurista José Afonso da Silva - uma referência no âmbito do direito constitucional brasileiro.\nPróximos passos\nMais do que tirar grandes conclusões - o que seria leviano face a complexidade do tema - procuramos levantar discussões que possam ser úteis ao direito e à jurimetria.\nContudo, há muito trabalho a ser feito para desvendar um pouco mais o comportamento de nossas instituições e sua interação com a esfera jurídica.\nO que se pode inferir, a princípio, é que há uma diferença muito grande na atuação entre os grupos legitimados e que houve, de fato, uma grande provocação do Supremo ao longo de 2020 para atuar com questões relativas à pandemia. O quadro político atual demonstra, então, a relevância de termos olhos atentos para essa Corte.\nUma série de temas e questões ainda podem (e devem) ser exploradas, sobretudo se aplicadas técnicas de processamento de linguagem natural (NPL). Como exemplo:\nAnálise aprofundada dos termos mais característicos de cada proponente\nIdentificação das teses mais utilizadas\nAnálise da atuação de outros sujeitos processuais como os amicus curiae\nComparação do tempo de tramitação entre as ações, a fim de verificar o que o Tribunal tem dado maior atenção\nImpacto das sessões virtuais assíncronas (o “Plenário Virtual”) na tramitação das ações de controle concentrado\netc\nMão à obra?\n\n\n\n",
    "preview": "posts/2021-04-13-stf-controle-concentrado/grafico_perfil_ato_federal_questionado-1.png",
    "last_modified": "2021-05-14T12:09:33+08:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  }
]
